{"pub_type": "Journal Article", "access_type": "", "journal": "Bulletin of Materials Science", "doi": "", "pmid": "", "pmc": "", "title": "First-principle-based computational doping of SrTiO$_3$ using combinatorial genetic algorithms", "authors": [{"name": "EMRAH ATILGAN", "institute": [[{"apid": "", "federation": "", "acronym": "", "address": "Department of Computer Science and Engineering, University of South Carolina, Columbia, SC 29208, USA.", "city": "", "district": "", "state": "", "country": "USA.", "name": "University of South Carolina"}]]}, {"name": "JIANJUN HU", "institute": [[{"apid": "", "federation": "", "acronym": "", "address": "Department of Computer Science and Engineering, University of South Carolina, Columbia, SC 29208, USA.", "city": "", "district": "", "state": "", "country": "USA.", "name": "University of South Carolina"}], [{"apid": "", "federation": "", "acronym": "", "address": "School of Mechanical Engineering, Guizhou University, Guiyang 590050, China.", "city": "", "district": "", "state": "", "country": "China.", "name": "Guizhou University"}]]}], "volume": "41", "issue": "1", "pagenum": "Article ID 1", "date_received": null, "date_accepted": null, "date_published": "2018-02-01", "abstract_text": "Developing new materials has historically been time-consuming. One commonly used approach is materialdoping, in which given a base material, one can change its properties by substituting some elements with new ones or addingadditional elements. Computational material discovery involves searching in a large design space to identify candidates forexperimental verification. Recently, it was possible to obtain many electrical and physical properties of materials by densityfunctional theory based first-principle calculation, making it suitable for computational doping-based material discovery. Incomputational doping, one can substitute some of the atoms in a supercell with dopant atoms. However, the actual positionsof the dopant elements within the supercell are not known. In this work, we developed a genetic algorithm for finding themost stable structure of the doped material with the lowest free electronic energy. For each candidate atom configuration,we use the Vienna Ab-Initio Simulation Package to calculate its physicochemical properties, which takes about 15–30 h fora supercell grid of 75 atoms.We did computational doping on SrTiO$_3$ perovskite. Experiments showed that our method canreduce the running time for computational doping by up to 70% compared with exhaustive sampling as commonly usednow.", "keywords": "Computational doping; material doping; genetic algorithm; combinatorial optimization; VASP; DFT.", "pdf_url": "http://www.ias.ac.in/article/fulltext/boms/041/01/0001", "html_url": "http://www.ias.ac.in/describe/article/boms/041/01/0001"}